Revit 2024 API
FabricSheet Class
 An object that represents an Fabric Sheet Element within the Autodesk Revit project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class FabricSheet : Element
Visual Basic
Public Class FabricSheet _
	Inherits Element
Visual C++
public ref class FabricSheet : public Element
Remarks
 Beginning with Revit 2016, fabric sheets can be either flat or bent. Both kinds of fabric sheets are implemented by this FabricSheet class. Fabric sheets are created as either flat or bent. Once created, the kind of a fabric sheet cannot be changed. The Fabric Sheet element is available only in the Autodesk Revit Structure product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.FabricSheet
See Also
FabricSheet Members
Autodesk.Revit.DB.Structure Namespace